Repository: utaschulz1/patent-translation-agent
Catalog: Matecat/HUAW_old/HUAW_old.tmx
Source language: en_us
Languages: de_de

source: 1. An antenna, comprising a main stub (10), a first parasitic stub (20), and a second parasitic stub (30), wherein
de_de: 1. Antenne, umfassend einen Haupt-Stub (10), einen ersten parasitären Stub (20) und einen zweiten parasitären Stub (30), wobei

source: the main stub (10) comprises a first end (a) and a second end (b), a feed point (c) is disposed on the main stub (10), the feed point (c) is close to the second end (b), and the feed point (c) is configured to connect to a feed line,
de_de: der Haupt-Stub (10) ein erstes Ende (a) und ein zweites Ende (b) umfasst, ein Einspeisepunkt (c) an dem Haupt-Stub (10) angeordnet ist, der Einspeisepunkt (c) nahe dem zweiten Ende (b) ist und der Einspeisepunkt (c) konfiguriert ist, um mit einer Speiseleitung verbunden zu sein,

source: a first ground point (d) is disposed on the main stub (10), and the first ground point (d) is close to the first end (a) and far away from the second end (b);
de_de: ein erster Erdungspunkt (d) an dem Haupt-Stub (10) angeordnet ist und der erste Erdungspunkt (d) nahe dem ersten Ende (a) und weit entfernt von dem zweiten Ende (b) ist;

source: the first parasitic stub (20) and the second parasitic stub (30) are respectively arranged on two sides of the main stub (10);
de_de: der erste parasitäre Stub (20) und der zweite parasitäre Stub (30) entsprechend auf zwei Seiten des Haupt-Stub (10) angeordnet sind;

source: the first parasitic stub (20) comprises a third end (e) and a fourth end (f), the second parasitic stub (30) comprises a fifth end (h) and a sixth end (i), the first parasitic stub (20) is coupled to the main stub (10) via the gap between the second end (b) and the third end (e), the second parasitic stub (30) is coupled to the main stub (10) via the gap between the first end (a) and the fifth end (h);
de_de: der erste parasitäre Stub (20) ein drittes Ende (e) und ein viertes Ende (f) umfasst, der zweite parasitäre Stub (30) ein fünftes Ende (h) und ein sechstes Ende (i) umfasst, der erste parasitäre Stub (20) über den Spalt zwischen dem zweiten Ende (b) und dem dritten Ende (e) mit dem Haupt-Stub (10) gekoppelt ist, der zweite parasitäre Stub (30) über den Spalt zwischen dem ersten Ende (a) und dem fünften Ende (h) mit dem Haupt-Stub (10) gekoppelt ist;

source: a second ground point (g) is disposed on the first parasitic stub (20), at a location that is away from the third end (e);
de_de: ein zweiter Erdungspunkt (g) an dem ersten parasitären Stub (20) an einer Stelle angeordnet ist, die von dem dritten Ende (e) entfernt ist;

source: a third ground point (j) is disposed on the second parasitic stub (30) at a location that is close to the fifth end (h),
de_de: ein dritter Erdungspunkt (j) an dem zweiten parasitären Stub (30) an einer Stelle angeordnet ist, die nahe dem fünften Ende (h) ist,

source: a fourth ground point (k) is disposed on a side that is of the second parasitic stub (30) and that is close the sixth end (i); and
de_de: ein vierter Erdungspunkt (k) auf einer Seite, die von dem zweiten parasitären Stub (30) ist und die nahe dem sechsten Ende (i) ist, angeordnet ist; und

source: a fifth ground point (1) is disposed on a side that is of the first parasitic stub (30) and that is close to the fourth end (f);
de_de: ein fünfter Erdungspunkt (1) auf einer Seite, die von dem ersten parasitären Stub (30) ist und die nahe dem vierten Endes (f) ist, angeordnet ist;

source: wherein, a frequency of a resonance excited by the first parasitic stub (20) is greater than a frequency of a resonance excited by the main stub (10); and a frequency of a resonance excited by the second parasitic stub (30) is less than the frequency of the resonance excited by the main stub (10).
de_de: wobei eine Frequenz einer durch den ersten parasitären Stub (20) angeregten Resonanz größer ist als eine Frequenz einer durch den Haupt-Stub (10) angeregten Resonanz; und eine Frequenz einer durch den zweiten parasitären Stub (30) angeregten Resonanz kleiner ist als die Frequenz der durch den Haupt-Stub (10) angeregten Resonanz.

source: 2. The antenna according to claim 1, wherein the first parasitic stub (20) is a parasitic stub configured to excite resonances in two different modes; and
de_de: 2. Antenne nach Anspruch 1, wobei der erste parasitäre Stub (20) ein parasitärer Stub ist, konfiguriert, um Resonanzen in zwei verschiedenen Modi anzuregen; und

source: the second parasitic stub (30) is a parasitic stub configured to excite resonances in two different modes.
de_de: der zweite parasitäre Stub (30) ein parasitärer Stub ist, konfiguriert, um Resonanzen in zwei unterschiedlichen Modi anzuregen.

source: 3. The antenna according to claim 2, wherein the resonances in the two different modes comprise any two of a resonance in a 1/4λ mode, a resonance in a 1/2λ mode, a resonance in a 3/4λ mode, or a resonance in a λ mode, wherein λ is a wavelength corresponding to an operating frequency of the antenna.
de_de: 3. Antenne nach Anspruch 2, wobei die Resonanzen in den zwei unterschiedlichen Modi zwei beliebige von einer Resonanz in einem 1/4λ-Modus, einer Resonanz in einem 1/2λ-Modus, einer Resonanz in einem 3/4λ-Modus oder einer Resonanz in einem λ-Modus umfassen, wobei λ eine Wellenlänge ist, die einer Betriebsfrequenz der Antenne entspricht.

source: 4. The antenna according to any of claims 1-3, wherein the second ground point (g) is connected to a high-pass low-cut filter circuit (40) of the antenna.
de_de: 4. Antenne nach einem der Ansprüche 1-3, wobei der zweite Erdungspunkt (g) mit einer Hochpass-Tiefpassfilterschaltung (40) der Antenne verbunden ist.

source: 5. The antenna according to any one of claims 1 to 4, wherein the second ground point (g), the third ground point (j), or the fourth ground point is separately connected to a tunable component of the antenna or a fixed component of the antenna.
de_de: 5. Antenne nach einem der Ansprüche 1 bis 4, wobei der zweite Erdungspunkt (g), der dritte Erdungspunkt (j) oder der vierte Erdungspunkt separat mit einer abstimmbaren Komponente der Antenne oder einer festen Komponente der Antenne verbunden ist.

source: 6. The antenna according to claim 5, wherein the fixed component is any one of a fixed resistor component, a fixed capacitor component, a fixed inductor component, a distributed inductor, a distributed capacitor, and a filter circuit; and
de_de: 6. Antenne nach Anspruch 5, wobei die feste Komponente eine feste Widerstandskomponente, eine feste Kondensatorkomponente, eine feste Induktorkomponente, eine verteilte Induktorkomponente, ein verteilter Kondensator oder eine Filterschaltung ist; und

source: the tunable component is one of a switch or a variable capacitor.
de_de: die abstimmbare Komponente entweder ein Schalter oder ein variabler Kondensator ist.

source: 7. The antenna according to claim 1, wherein the first parasitic stub (20) is a parasitic stub configured to excite a resonance in a first mode, the second parasitic stub (30) is a parasitic stub configured to excite a resonance in a second mode, and the first mode is the same as the second mode.
de_de: 7. Antenne nach Anspruch 1, wobei der erste parasitäre Stub (20) ein parasitärer Stub ist, konfiguriert, um eine Resonanz in einem ersten Modus anzuregen, der zweite parasitäre Stub (30) ein parasitärer Stub ist, der konfiguriert ist, um eine Resonanz in einem zweiten Modus anzuregen, und der erste Modus derselbe ist wie der zweite Modus.

source: 8. The antenna according to claim 1, wherein the first parasitic stub (20) is a parasitic stub configured to excite a resonance in a first mode, the second parasitic stub (30) is a parasitic stub configured to excite a resonance in a second mode, and the first mode is different from the second mode.
de_de: 8. Antenne nach Anspruch 1, wobei der erste parasitäre Stub (20) ein parasitärer Stub ist, konfiguriert, um eine Resonanz in einem ersten Modus anzuregen, der zweite parasitäre Stub (30) ein parasitärer Stub ist, der konfiguriert ist, um eine Resonanz in einem zweiten Modus anzuregen, und sich der erste Modus von dem zweiten Modus unterscheidet.

source: 9. The antenna according to claim 7 or 8, wherein in the first mode or the second mode is any one of:1/4λ mode, 1/2λ mode, 3/4λ mode, or λ mode, wherein λ is a wavelength corresponding to an operating frequency of the antenna.
de_de: 9. Antenne nach Anspruch 7 oder 8, wobei der erste Modus oder der zweite Modus einer der folgenden ist: 1/4λ-Modus, 1/2λ-Modus, 3/4λ-Modus oder λ-Modus, wobei λ eine Wellenlänge ist, die einer Betriebsfrequenz der Antenne entspricht.

source: A mobile terminal, comprising a housing (100) and the antenna according to any one of claims 1 to 9 disposed in the housing (100).
de_de: Mobiles Endgerät, umfassend ein Gehäuse (100) und die in dem Gehäuse (100) angeordnete Antenne nach einem der Ansprüche 1 bis 9.

source: 1. A three-level boost converter, comprising: a first switching transistor (T1), a second switching transistor (T2), an inductor (L), a flying capacitor (Cfly), and a controller, wherein the first switching transistor (T1) and the second switching transistor (T2) are primary power transistors, a first terminal of the inductor (L) is connected to a first input of the converter, and a second terminal of the inductor (L) is connected to a first node (A), a first terminal of the first switching transistor (T1) is connected to the first node (A), and a second terminal of the first switching transistor (T1) is connected to a second node (B), and a first terminal of the second switching transistor (T2) is connected to the second node (B), and a second terminal of the second switching transistor (T2) is connected to a second input of the converter;
de_de: 1. Dreistufiger Aufwärtswandler, umfassend: einen ersten Schalttransistor (T1), einen zweiten Schalttransistor (T2), eine Induktivität (L), einen fliegenden Kondensator (Cfly) und eine Steuerung, wobei der erste Schalttransistor (T1) und der zweite Schalttransistor (T2) primäre Leistungstransistoren sind, ein erster Anschluss der Induktivität (L) mit einem ersten Eingang des Wandlers verbunden ist und ein zweiter Anschluss der Induktivität (L) mit einem ersten Knoten (A) verbunden ist, ein erster Anschluss des ersten Schalttransistors (T1) mit dem ersten Knoten (A) verbunden ist und ein zweiter Anschluss des ersten Schalttransistors (T1) mit einem zweiten Knoten (B) verbunden ist und ein erster Anschluss des zweiten Schalttransistors (T2) mit dem zweiten Knoten (B) verbunden ist und ein zweiter Anschluss des zweiten Schalttransistors (T2) mit einem zweiten Eingang des Wandlers verbunden ist;

source: when a voltage (Vc) of the flying capacitor (Cfly) is less than or equal to a half of a bus voltage (Vo), the controller is configured to send a first driving signal to the first switching transistor (T1), and send a second driving signal to the second switching transistor (T2); or when the voltage of the flying capacitor (Cfly) is greater than a half of the bus voltage (Vo), the controller is configured to send a first driving signal to the second switching transistor (T2), and sends a second driving signal to the first switching transistor (T1), wherein the bus voltage (Vo) is an output voltage of the three-level boost converter; and
de_de: wenn eine Spannung (Vc) des fliegenden Kondensators (Cfly) kleiner oder gleich einer Hälfte einer Busspannung (Vo) ist, die Steuerung konfiguriert ist, um ein erstes Treibersignal an den ersten Schalttransistor (T1) und ein zweites Treibersignal an den zweiten Schalttransistor (T2) zu senden; oder wenn die Spannung des fliegenden Kondensators (Cfly) größer als die Hälfte der Busspannung (Vo) ist, die Steuerung konfiguriert ist, um ein erstes Treibersignal an den zweiten Schalttransistor (T2) und ein zweites Treibersignal an den ersten Schalttransistor (T1) zu senden, wobei die Busspannung (Vo) eine Ausgangsspannung des dreistufigen Aufwärtswandlers ist; und

source: the second driving signal has N pulses in each period of the first driving signal, the inductor (L) has N+1 charge and discharge periods in each period of the first driving signal, and N is an integer greater than or equal to 2,
de_de: das zweite Treibersignal N Impulse in jeder Periode des ersten Treibersignals aufweist, die Induktivität (L) N+1 Lade- und Entladeperioden in jeder Periode des ersten Treibersignals aufweist und N eine Ganzzahl größer oder gleich 2 ist,

source: wherein the three-level boost converter further comprises a third switching transistor and a fourth switching transistor, wherein
de_de: wobei der dreistufige Aufwärtswandler ferner einen dritten Schalttransistor und einen vierten Schalttransistor umfasst, wobei

source: a first terminal and a second terminal of the third switching transistor are respectively connected to the first node (A) and a third node (C), a first terminal and a second terminal of the fourth switching transistor are respectively connected to the third node (C) and a first output of the three-level boost converter, a first terminal of the flying capacitor (Cfly) is connected to the second node (B), and a second terminal of the flying capacitor (Cfly) is connected to the third node (C), and the second terminal of the second switching transistor (T2) is connected to a second output of the three-level boost converter.
de_de: ein erster Anschluss und ein zweiter Anschluss des dritten Schalttransistors jeweils mit dem ersten Knoten (A) und einem dritten Knoten (C) verbunden sind, ein erster Anschluss und ein zweiter Anschluss des vierten Schalttransistors jeweils mit dem dritten Knoten (C) und einem ersten Ausgang des dreistufigen Aufwärtswandlers verbunden sind, ein erster Anschluss des fliegenden Kondensators (Cfly) mit dem zweiten Knoten (B) verbunden ist, und ein zweiter Anschluss des fliegenden Kondensators (Cfly) mit dem dritten Knoten (C) verbunden ist, und der zweite Anschluss des zweiten Schalttransistors (T2) mit einem zweiten Ausgang des dreistufigen Aufwärtswandlers verbunden ist.

source: 2. The converter according to claim 1, wherein the second driving signal has N pulses in a low-level time period of each period of the first driving signal, wherein the first driving signal has a high voltage level and a low voltage level, and the low-level time period of each period of the first driving signal corresponds to a time period with the low voltage level of each period of the first driving signal.
de_de: 2. Wandler nach Anspruch 1, wobei das zweite Treibersignal N Impulse in einer niedrigstufigen Zeitperiode jeder Periode des ersten Treibersignals aufweist, wobei das erste Treibersignal eine hohen Spannungsstufe und eine niedrigen Spannungsstufe aufweist und die niedrigstufige Zeitperiode jeder Periode des ersten Treibersignals einer Zeitperiode mit der niedrigen Spannungsstufe jeder Periode des ersten Treibersignals entspricht.

source: 3. The converter according to any one of claims 1 to 2, wherein frequencies corresponding to at least two pulses of the N pulses are different, wherein the N pulses have a same pulse width, wherein frequencies corresponding to all the N pulses are different.
de_de: 3. Wandler nach einem der Ansprüche 1 bis 2, wobei Frequenzen, die mindestens zwei Impulsen der N Impulse entsprechen, unterschiedlich sind, wobei die N Impulse die gleiche Impulsbreite aufweisen, wobei Frequenzen, die allen N Impulsen entsprechen, unterschiedlich sind.

source: 4. The converter according to any one of claims 1 to 3, wherein N is greater than or equal to 3.
de_de: 4. Wandler nach einem der Ansprüche 1 bis 3, wobei N größer oder gleich 3 ist.

source: 5. The converter according to claim 4, wherein frequencies of first N–1 pulses of the N pulses are the same, and a frequency of a last pulse of the N pulses is less than the frequency of the first N–1 pulses.
de_de: 5. Wandler nach Anspruch 4, wobei die Frequenzen der ersten N–1 Impulse der N Impulse gleich sind und die Frequenz eines letzten Impulses der N Impulse kleiner ist als die Frequenz der ersten N–1 Impulse.

source: 6. The converter according to any one of claims 1 to 5, wherein in each period of the first driving signal, a rising edge of a first pulse of the N pulses follows a falling edge of the first driving signal, wherein the controller is configured to control a charge current of the inductor (L) to be equal to a discharge current of the inductor (L) in each charge and discharge period, to determine the time lag.
de_de: 6. Wandler nach einem der Ansprüche 1 bis 5, wobei in jeder Periode des ersten Treibersignals eine steigende Flanke eines ersten Impulses der N Impulse auf eine fallende Flanke des ersten Treibersignals folgt, wobei die Steuerung konfiguriert ist, um einen Ladestrom der Induktivität (L) zu steuern, sodass er in jeder Lade- und Entladeperiode gleich einem Entladestrom der Induktivität (L) ist, um die Zeitverzögerung zu bestimmen.

source: 7. The converter according to claim 6, wherein the controller is further configured to determine the time lag based on an input voltage (Vin) and the output voltage of the three-level boost converter, a voltage of the flying capacitor (Cfly), and the period of the first driving signal.
de_de: 7. Wandler nach Anspruch 6, wobei die Steuerung ferner konfiguriert ist, um die Zeitverzögerung basierend auf einer Eingangsspannung (Vin) und der Ausgangsspannung des dreistufigen Aufwärtswandlers, einer Spannung des fliegenden Kondensators (Cfly) und der Periode des ersten Treibersignals zu bestimmen.

source: 8. The converter according to claim 7, wherein the controller is specifically configured to obtain the lag time, which is (D1+D2)Tsw, according to the following formula;
de_de: 8. Wandler nach Anspruch 7, wobei die Steuerung speziell konfiguriert ist, um die Verzögerungszeit, die (D1 + D2)Tsw beträgt, gemäß der folgenden Formel zu ermitteln;

source: wherein Vin is the input voltage of the three-level boost converter, Vo is the output voltage of the three-level boost converter, Vc is the voltage of the flying capacitor (Cfly), Tsw is the period of the first driving signal, D1 is a duty cycle of the three-level boost converter, and D2Tsw is a delay time between the rising edge of the first pulse of the N pulses and the falling edge of the first driving signal.
de_de: wobei Vin die Eingangsspannung des dreistufigen Aufwärtswandlers ist, Vo die Ausgangsspannung des dreistufigen Aufwärtswandlers ist, Vc die Spannung des fliegenden Kondensators (Cfly) ist, Tsw die Periode des ersten Treibersignals ist, D1 ein Tastverhältnis des dreistufigen Aufwärtswandlers ist und D2Tsw eine Verzögerungszeit zwischen der steigenden Flanke des ersten Impulses der N Impulse und der fallenden Flanke des ersten Treibersignals ist.

source: 9. The converter according to claim 6, wherein in each period of the first driving signal, the time lag between the first pulse of the N pulses and the first driving signal may be determined based on a loss of the first switching transistor (T1) and/or a loss of the second switching transistor (T2).
de_de: 9. Wandler nach Anspruch 6, wobei in jeder Periode des ersten Treibersignals die Zeitverzögerung zwischen dem ersten Impuls der N Impulse und dem ersten Treibersignal basierend auf einem Verlust des ersten Schalttransistors (T1) und/oder einem Verlust des zweiten Schalttransistors (T2) bestimmt werden kann.

source: The converter according to claim 6, wherein in each period of the first driving signal, the time lag between the first pulse of the N pulses and the first driving signal is determined based on a ripple current of the inductor (L) and a loss of at least one switching transistor.
de_de: Wandler nach Anspruch 6, wobei in jeder Periode des ersten Treibersignals die Zeitverzögerung zwischen dem ersten Impuls der N Impulse und dem ersten Treibersignal basierend auf einem Welligkeitsstrom der Induktivität (L) und einem Verlust von mindestens einem Schalttransistor bestimmt wird.

source: The converter according to any one of claims 1 to 10, further comprising a fifth switching transistor, wherein
de_de: Wandler nach einem der Ansprüche 1 bis 10, ferner einen fünften Schalttransistor umfassend, wobei

source: a first terminal of the fifth switching transistor is connected to the second node, and a second terminal of the fifth switching transistor is connected to the first terminal of the flying capacitor (Cfly).
de_de: ein erster Anschluss des fünften Schalttransistors mit dem zweiten Knoten verbunden ist und ein zweiter Anschluss des fünften Schalttransistors mit dem ersten Anschluss des fliegenden Kondensators (Cfly) verbunden ist.

source: A control method for a three-level boost converter, wherein the three-level boost converter comprises a first switching transistor (T1), a second switching transistor (T2), an inductor (L), a flying capacitor (Cfly), and a controller, and the first switching transistor (T1) and the second switching transistor (T2) are primary power transistors, a first terminal of the inductor (L) is connected to a first input of the converter, and a second terminal of the inductor (L) is connected to a first node (A), a first terminal of the first switching transistor (T1) is connected to the first node (A), and a second terminal of the first switching transistor (T1) is connected to a second node (B), and a first terminal of the second switching transistor (T2) is connected to the second node (B), and a second terminal of the second switching transistor (T2) is connected to a second input of the converter; and
de_de: Steuerungsverfahren für einen dreistufigen Aufwärtswandler, wobei der dreistufigen Aufwärtswandler einen ersten Schalttransistor (T1), einen zweiten Schalttransistor (T2), eine Induktivität (L), einen fliegenden Kondensator (Cfly) und eine Steuerung umfasst, und der erste Schalttransistor (T1) und der zweite Schalttransistor (T2) primäre Leistungstransistoren sind, ein erster Anschluss der Induktivität (L) mit einem ersten Eingang des Wandlers verbunden ist und ein zweiter Anschluss der Induktivität (L) mit einem ersten Knoten (A) verbunden ist, ein erster Anschluss des ersten Schalttransistors (T1) mit dem ersten Knoten (A) verbunden ist und ein zweiter Anschluss des ersten Schalttransistors (T1) mit einem zweiten Knoten (B) verbunden ist und ein erster Anschluss des zweiten Schalttransistors (T2) mit dem zweiten Knoten (B) verbunden ist und ein zweiter Anschluss des zweiten Schalttransistors (T2) mit einem zweiten Eingang des Wandlers verbunden ist; und

source: the method comprises:
de_de: wobei das Verfahren Folgendes umfasst:

source: when a voltage of the flying capacitor (Cfly) is less than or equal to a half of a bus voltage (Vo), sending a first driving signal to the first switching transistor (T1), and sending a second driving signal to the second switching transistor (T2); or
de_de: wenn eine Spannung des fliegenden Kondensators (Cfly) kleiner oder gleich der Hälfte einer Busspannung (Vo) ist, Senden eines ersten Treibersignals an den ersten Schalttransistor (T1) und Senden eines zweiten Treibersignals an den zweiten Schalttransistor (T2); oder

source: when the voltage of the flying capacitor (Cfly) is greater than a half of the bus voltage (Vo), sending a first driving signal to the second switching transistor (T2), and sending a second driving signal to the first switching transistor (T1), wherein
de_de: wenn die Spannung des fliegenden Kondensators (Cfly) größer der Hälfte der Busspannung (Vo) ist, Senden eines ersten Treibersignals an den zweiten Schalttransistor (T2) und Senden eines zweiten Treibersignals an den ersten Schalttransistor (T1); wobei
